### UNION  ALL

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT stdName, addr FROM stdtbl
	UNION ALL
SELECT clubName,roomNo FROM clubtbl;   '''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0   1
0  김범수  경남
1  바비킴  서울
2  성시경  서울
3  은지원  경북
4  조용필  경기

### NOT IN

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT name, CONCAT(mobile1,mobile2) AS '전화번호' FROM usertbl
WHERE name NOT IN (SELECT name FROM usertbl WHERE mobile1 IS NULL); '''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0           1
0  바비킴  0100000000
1  은지원  0118888888
2  조관우  0189999999
3  조용필  0114444444
4  김범수  0112222222

###  IN

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT name, CONCAT(mobile1,mobile2) AS '전화번호' FROM usertbl
WHERE name IN (SELECT name FROM usertbl WHERE mobile1 IS NULL); '''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1.head()

     0     1
0  성시경  None
1  윤종신  None